
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ФайлТХТ = Новый ТекстовыйДокумент;
	Попытка
		ФайлТХТ.Прочитать(Параметры.ПутьКФайлу, КодировкаТекста.UTF8, Символы.ПС);
		ТекстовыйФайл = ФайлТХТ.ПолучитьТекст();
	Исключение
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось прочитать файл по причине: " + ОписаниеОшибки();
		Сообщение.Сообщить();
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры
